var net = require('net');
var _ = require('lodash');

var off = 0;
var direction = 1;
var interval;

var fancyMartin = "\n"+
"                          ╦▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▌╣▓▒⌐\n"+
"                        ╓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▄╖\n"+
"                     ╖╣▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▌▄,µ\n"+
"                  ,╗▌▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓Q\n"+
"                ,╣██▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒\n"+
"              ╪▒▓▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▌╤\n"+
"            ╓▌▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▌╣\n"+
"            ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▓▒\n"+
"           ▒█▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▀δδÑ░░░▒██▒▒█▓▓▓▓▓▓█▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒\n"+
"           ▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▒δ░    ⌐⌂╙╨░░░░δδδδδδ░δ▒▒▒█▓▓▓▓▓▓▓▓▓▓▓▌⌐\n"+
"           ▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█Θ░           `░      ''░░░░░╬▒▓▓▓▓▓▓▓▓▓▓Γ\n"+
"           ▀╬▓▓▓▓▓▓▓▓▓▓█▀ΣΓⁿ                       ' '░░░╣▒▓▓▓▓▓▓▓▓▌\n"+
"            ╚▓▓▓▓▓▓▓▓█δ░                            ' ░░░░╢▓▓▓▓▓▓▓▓Θ\n"+
"            :█▓▓▓▓▓█δ░                               '░░░░╢█▓▓▓▓▓▓▌\n"+
"            «▓▓▓▓▓▓▒░                                '░░░░░▒▓▓▓▓▓▓δ\n"+
"             ╟▓▓▓▓▓▌░⌐                               -░░░░░╠█▓▓▓▓▓`\n"+
"              ▒▓▓▓▓▌░     ⌐░░╣╣╢░░░░        ⌐░░╢╠╬╣Θ░░░░░░░░╢▓▓▓▓▌\n"+
"             ░δ▒▓▓▓▒     -╓╦╗▄▒▒▒╣░░░░⌐   '░╢╣╣▒▒▄▄▄▒▄Q░░░⌐⌐╙▓▓▓▒▒╡\n"+
"              ⌐ ╠█▓Θ    ░░δ░║▓▓▓C`░░░░░   ░╢▒▒Θ ╚▓▓▓Θ░▒▒╬░░⌐⌂█▓█░δ\n"+
"                ░▒▌░         ╙Γ╙ '' ░░░   ░░░░░ '╙Γ'░░░░░░⌐  ▒▌░░\n"+
"               '░▒░⌐               ''     ░░░░░⌐      '' '░  ╫▒╣░\n"+
"                  ╫░                      ░░░░░░⌐        -░⌐ ╟░░⌐\n"+
"                  ░░               '⌐⌐    '░░░╢░░⌐    ⌐ -░░⌐ ░░\n"+
"                   '              ░⌐      '░░░╢▒░⌐⌐⌐⌐ '░░░░░ ░`\n"+
"                                ⌐░░░╣▒╦░░╖▄▄▄╣▒▒Θ░░░░░░░░░░░ ░\n"+
"                    ⌐             '░╟▒▒╬▒▒▒█▌▒░'░░ ░░░░░░░░░░\n"+
"                     ░⌐    ⌐       ╓╣▒▌▓▓▓▌▓▓▌╣░░ -░░░░░░░░░\n"+
"                     ░░░⌐'░░░░░╦╢╣▒▓█████████▓▓▒▒▒╣╣░░░░░░░╣⌐\n"+
"                     ░░░░░░░▒▒▒███▒▒▒╣╣╣╣▄▒▒▒▒▒████▌▒╣░░╢▒╣░\n"+
"                     ╘╢░░░░░░░░  ░░░░░░░░░░░░░░░░░░░╢░░╣▒▒▒╡\n"+
"                      ░░░╦░░░░░⌐⌐ ░░╢╣╣▒▒▒▒▒▒▒╣░░░░░░╢▒▒▌▒▒⌐\n"+
"                      ╙╣╢╣░░░░░░░░⌐' ░╨δδδδ░░░░░░░░░╬▒▒▓▓▌▒\n"+
"                       ░▒▒▒▒▒╣╬░⌐'         ' '░░░░╢╣▌▓▓▓▓▒░⌐½\n"+
"                        'Σ█▓▓▌▌╣╦░░,    -⌐⌐-░░░╢╬╣▒▓▓▓▓█▒╣░░µ▀▄\n"+
"                      ⌐  ░░▒█▓▓▓▓▌▒╣╣╣╣░╣╣╣╣▒▌▓▓▓▓▓▓▓▓█▒╣░░╢▌ ▓▓▒▄,\n"+
"                    ╖▒   '░░░δ▀█▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▒▒╬░░╢╣▒  ▓▓▓▓▓▄╦▄,\n"+
"\n";

var server = net.createServer(function(socket) {
	console.log("Client connected");
	socket.on("end", function() {
		clearInterval(interval);
		console.log("Disconnected");
	});
	clear(socket);
	socket.write("Welcome to Asciimartin");
	interval = setInterval(function() { writeAscii(socket) }, 50);
});

server.listen(8000);

var clear = function(socket) {
	socket.write('\033[2J');
	socket.write('\033[H');
}

var writeAscii = function(socket) {
	if(direction === 1 && off > 100) {
		direction = -1;
	} else if(direction === -1 && off === 0) {
		direction = 1;
	}

	off += direction;
	clear(socket);
	var asciiLines = fancyMartin.split("\n");
	var padding = "";
	for(var i = 0; i < off; i++) {
		padding += " ";
	}

	var paddedLines = [];
	for(var i = 0; i < asciiLines.length; i++) {
		paddedLines.push(padding + asciiLines[i]);
	}

	var outputString = paddedLines.join("\n");
	socket.write(outputString);
}
